# Задание 1 ----------------------------
# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

# Запрос ввоода имени и целочисленного значения возрастаю. Вывод на экран полноценного предложения с 2мя переменными.
print("----- lesson 1, task 1a -----")
name = input("Здравствуйте, как ваше имя? ")
age = int(input("Каков ваш возраст? "))
print(name, "вам сейчас ", age, " лет.")

# Сложение двух переменных х и y
print("----- lesson 1, task 1b -----")
print("Addition of two numbers")
x = float(input("Enter first number: "))
y = float(input("Enter second number: "))
print("Result is: ", x + y)
print("=====================================")