"""
Создать (не программно) текстовый файл со следующим содержимым:
One — 1
Two — 2
Three — 3
Four — 4

Напишите программу, открывающую файл на чтение и считывающую построчно данные.
При этом английские числительные должны заменяться на русские.
Новый блок строк должен записываться в новый текстовый файл.
"""

# =========== решение задания 5.4 ==============

# Формируем словарь со значениями и список, куда будем сохранять новые значения;
rus = {'One': 'Один', 'Two': 'Два', 'Three': 'Три', 'Four': 'Четыре'}
new_file = []

# Читаем файл, в каждой строке меняем на значения из словаря.
# Полученный результат записываем в список new_file
# Выводим получившийся список на экран
with open('test_4.txt', 'r', encoding="utf-8") as file_obj:
    for i in file_obj:
        i = i.split(' ', 1)
        new_file.append(rus[i[0]] + ' ' + i[1])
    print(new_file)

# Записываем получившийся новый список файл
with open('test_4_new.txt', 'w', encoding="utf-8") as file_obj_2:
    file_obj_2.writelines(new_file)
